#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0beea11464aa98826]
aws_dynamodb_table.example-dynamodb-table: Refreshing state... [id=GameScores]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f80253ea0c5c64d7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03efeb2415ef9cb40]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0822e5d2833116c8a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-092263c8b0ef10131]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0dad8538e65e1233a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05635e459d9541e98]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0afd99b5b90a58de7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04ba76798d1b5dffb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08fdd9013a65b53a5]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04ba76798d1b5dffb1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09f43fd34dbada9d8]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05efd60411735ee8b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-003a06f6f3fd7142b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0696b7557f64cc366]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03efeb2415ef9cb401080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-003ba147b5dd3fa4d"
        id                   = "eipalloc-0beea11464aa98826"
      + network_interface    = "eni-0efb43ef9a193d126"
      + private_dns          = "ip-10-68-27-156.ap-southeast-2.compute.internal"
      + private_ip           = "10.68.27.156"
        tags                 = {
            "Name" = "pluralith-demo-ap-southeast-2a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-03efeb2415ef9cb40"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-08fdd9013a65b53a5"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "pluralith-demo-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-04ba76798d1b5dffb"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-05635e459d9541e98"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "pluralith-demo-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.example-dynamodb-table will be updated in-place
  ~ resource "aws_dynamodb_table" "example-dynamodb-table" {
        id             = "GameScores"
        name           = "GameScores"
      ~ tags           = {
          - "Environment" = "production" -> null
          - "Name"        = "dynamodb-table-1" -> null
        }
      ~ tags_all       = {
          - "Environment" = "production"
          - "Name"        = "dynamodb-table-1"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

      + global_secondary_index {
          + hash_key           = "GameTitle"
          + name               = "GameTitleIndex"
          + non_key_attributes = [
              + "UserId",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "TopScore"
          + read_capacity      = 10
          + write_capacity     = 10
        }
      - global_secondary_index {
          - hash_key           = "GameTitle" -> null
          - name               = "GameTitleIndex" -> null
          - non_key_attributes = [
              - "UserId",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - range_key          = "TopScore" -> null
          - read_capacity      = 20 -> null
          - write_capacity     = 20 -> null
        }

      ~ ttl {
          + attribute_name = "TimeToExist"
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_redshift_cluster.example-redshift-cluster will be created
  + resource "aws_redshift_cluster" "example-redshift-cluster" {
      + allow_version_upgrade               = true
      + arn                                 = (known after apply)
      + automated_snapshot_retention_period = 1
      + availability_zone                   = (known after apply)
      + cluster_identifier                  = "tf-redshift-cluster"
      + cluster_nodes                       = (known after apply)
      + cluster_parameter_group_name        = (known after apply)
      + cluster_public_key                  = (known after apply)
      + cluster_revision_number             = (known after apply)
      + cluster_security_groups             = (known after apply)
      + cluster_subnet_group_name           = (known after apply)
      + cluster_type                        = "single-node"
      + cluster_version                     = "1.0"
      + database_name                       = "mydb"
      + dns_name                            = (known after apply)
      + encrypted                           = false
      + endpoint                            = (known after apply)
      + enhanced_vpc_routing                = (known after apply)
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "exampleuser"
      + node_type                           = "dc1.large"
      + number_of_nodes                     = 1
      + port                                = 5439
      + preferred_maintenance_window        = (known after apply)
      + publicly_accessible                 = true
      + skip_final_snapshot                 = false
      + tags_all                            = (known after apply)
      + vpc_security_group_ids              = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @pinaki-m, Action: `pull_request`*